using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace PF.Workstation.AutoOcr.CostParam
{
    public enum E_AxisName
    {
        视觉X轴,
        视觉Y轴,
        视觉Z轴,
        工位1上料Z轴,
        工位1挡料X轴,
        工位1拉料Y轴,
        工位2上料Z轴,
        工位2挡料X轴,
        工位2拉料Y轴,
    }

    /// <summary>
    /// 输入信号名称
    /// </summary>
    public enum E_InPutName
    {
        上晶圆左铁环位置检测 = 0,
        上晶圆左错层检测1 = 1,
        上晶圆左错层检测2 = 2,
        上晶圆左错层检测3 = 3,
        上晶圆左8寸铁环防反检测 = 4,
        上晶圆左12寸铁环防反检测 = 5,
        上晶圆左料盒倾斜检测1 = 6,
        上晶圆左料盒倾斜检测2 = 7,
        上晶圆左8寸料盒挡杆检测 = 8,
        上晶圆左12寸料盒挡杆检测1 = 9,
        上晶圆左12寸料盒挡杆检测2 = 10,
        预留1 = 11,
        上晶圆右铁环位置检测 = 12,
        上晶圆右错层检测1 = 13,
        上晶圆右错层检测2 = 14,
        上晶圆右错层检测3 = 15,
        上晶圆右8寸铁环防反检测 = 16,
        上晶圆右12寸铁环防反检测 = 17,
        上晶圆右料盒倾斜检测1 = 18,
        上晶圆右料盒倾斜检测2 = 19,
        上晶圆右8寸料盒挡杆检测 = 20,
        上晶圆右12寸料盒挡杆检测1 = 21,
        上晶圆右12寸料盒挡杆检测2 = 22,
        预留2 = 23,
        晶圆夹爪左气缸张开 = 24,
        晶圆夹爪左气缸闭合 = 25,
        晶圆夹爪左铁环有无检测 = 26,
        夹爪左叠料检测 = 27,
        晶圆夹爪左卡料检测1 = 28,
        晶圆夹爪左卡料检测2 = 29,
        晶圆夹爪左X轴气缸打开 = 30,
        晶圆夹爪左X轴气缸缩回 = 31,
        晶圆夹爪左叠片检测 = 32,
        预留3 = 33,
        预留4 = 34,
        预留5 = 35,
        晶圆夹爪右气缸张开 = 36,
        晶圆夹爪右气缸闭合 = 37,
        晶圆夹爪右铁环有无检测 = 38,
        夹爪右叠料检测 = 39,
        晶圆夹爪右卡料检测1 = 40,
        晶圆夹爪右卡料检测2 = 41,
        晶圆夹爪右X轴气缸打开 = 42,
        晶圆夹爪右X轴气缸缩回 = 43,
        晶圆夹爪右叠片检测 = 44,
        预留6 = 45,
        预留7 = 46,
        预留8 = 47,
        晶圆轨道左调宽气缸打开 = 48,
        晶圆轨道左调宽气缸磁缩回 = 49,
        晶圆轨道左晶圆在位检测1 = 50,
        晶圆轨道左晶圆在位检测2 = 51,
        晶圆轨道右调宽气缸打开 = 52,
        晶圆轨道右调宽气缸磁缩回 = 53,
        晶圆轨道右晶圆在位检测1 = 54,
        晶圆轨道右晶圆在位检测2 = 55,
        电磁门锁1信号 = 56,
        电磁门锁2信号 = 57,
        电磁门锁3信号 = 58,
        电磁门锁4信号 = 59

    }


    public enum E_OutPutName
    {
        [Browsable(false)]
        预留1 = 0,
        [Browsable(false)]
        预留2 = 1,
        [Browsable(false)]
        预留3 = 2,
        [Browsable(false)]
        预留4 = 3,
        [Browsable(false)]
        预留5 = 4,
        [Browsable(false)]
        预留6 = 5,
        [Browsable(false)]
        预留7 = 6,
        [Browsable(false)]
        预留8 = 7,
        夹爪气缸左闭合 = 8,
        夹爪气缸左张开 = 9,
        夹爪左X轴气缸伸出 = 10,
        夹爪左X轴气缸缩回 = 11,
        晶圆轨道左调宽气缸伸出 = 12,
        晶圆轨道左调宽气缸收回 = 13,
        [Browsable(false)]
        预留9 = 14,
        [Browsable(false)]
        预留10 = 15,
        夹爪气缸右闭合 = 16,
        夹爪气缸右张开 = 17,
        夹爪右X轴气缸伸出 = 18,
        夹爪右X轴气缸缩回 = 19,
        晶圆轨道右调宽气缸伸出 = 20,
        晶圆轨道右调宽气缸收回 = 21,
        [Browsable(false)]
        预留11 = 22,
        [Browsable(false)]
        预留12 = 23,
        三色灯红 = 24,
        三色灯黄 = 25,
        三色灯绿 = 26,
        蜂鸣器 = 27,
        电磁门锁1 = 28,
        电磁门锁2 = 29,
        电磁门锁3 = 30,
        电磁门锁4 = 31,
    }


    public enum E_ScanCode
    {
        工位1扫码枪,
        工位2扫码枪,
    }

    public enum E_WafeSize
    {
        _8寸,
        _12寸
    }

}
